feaser/openblt/Target/Demo/ARMCM3_LM3S_EK_LM3S6965_IAR/Boot/hooks.c
/************************************************************************************//**
* \file         Demo\ARMCM3_LM3S_EK_LM3S6965_IAR\Boot\hooks.c
* \brief        Bootloader callback source file.
* \ingroup      Boot_ARMCM3_LM3S_EK_LM3S6965_IAR
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*   Copyright (c) 2012  by Feaser    http://www.feaser.com    All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published by the Free
* Software Foundation, either version 3 of the License, or (at your option) any later
* version.
*
* OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
* without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
* PURPOSE. See the GNU General Public License for more details.
*
* You have received a copy of the GNU General Public License along with OpenBLT. It 
* should be located in ".\Doc\license.html". If not, contact Feaser to obtain a copy.
* 
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "boot.h"                                /* bootloader generic header          */
#if (BOOT_FILE_LOGGING_ENABLE > 0)
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/uartlib.h"
#endif


/****************************************************************************************
*   B A C K D O O R   E N T R Y   H O O K   F U N C T I O N S
****************************************************************************************/

#if (BOOT_BACKDOOR_HOOKS_ENABLE > 0)
/************************************************************************************//**
** \brief     Initializes the backdoor entry option.
** \return    none.
**
****************************************************************************************/
void BackDoorInitHook(void)
{
} /*** end of BackDoorInitHook ***/


/************************************************************************************//**
** \brief     Checks if a backdoor entry is requested.
** \return    BLT_TRUE if the backdoor entry is requested, BLT_FALSE otherwise.
**
****************************************************************************************/
blt_bool BackDoorEntryHook(void)
{
  /* default implementation always activates the bootloader after a reset */
  return BLT_TRUE;
} /*** end of BackDoorEntryHook ***/
#endif /* BOOT_BACKDOOR_HOOKS_ENABLE > 0 */


/****************************************************************************************
*   C P U   D R I V E R   H O O K   F U N C T I O N S
****************************************************************************************/

#if (BOOT_CPU_USER_PROGRAM_START_HOOK > 0)
/************************************************************************************//**
** \brief     Callback that gets called when the bootloader is about to exit and
**            hand over control to the user program. This is the last moment that
**            some final checking can be performed and if necessary prevent the
**            bootloader from activiting the user program.
** \return    BLT_TRUE if it is okay to start the user program, BLT_FALSE to keep
**            keep the bootloader active.
**
****************************************************************************************/
blt_bool CpuUserProgramStartHook(void)
{
  /* okay to start the user program */
  return BLT_TRUE;
} /*** end of CpuUserProgramStartHook ***/
#endif /* BOOT_CPU_USER_PROGRAM_START_HOOK > 0 */


/****************************************************************************************
*   N O N - V O L A T I L E   M E M O R Y   D R I V E R   H O O K   F U N C T I O N S
****************************************************************************************/

#if (BOOT_NVM_HOOKS_ENABLE > 0)
/************************************************************************************//**
** \brief     Callback that gets called at the start of the internal NVM driver
**            initialization routine. 
** \return    none.
**
****************************************************************************************/
void NvmInitHook(void)
{
} /*** end of NvmInitHook ***/


/************************************************************************************//**
** \brief     Callback that gets called at the start of a firmware update to reinitialize
**            the NVM driver.
** \return    none.
**
****************************************************************************************/
void NvmReinitHook(void)
{
} /*** end of NvmReinitHook ***/


/************************************************************************************//**
** \brief     Callback that gets called at the start of the NVM driver write 
**            routine. It allows additional memory to be operated on. If the address
**            is not within the range of the additional memory, then 
**            BLT_NVM_NOT_IN_RANGE must be returned to indicate that the data hasn't
**            been written yet.
** \param     addr Start address.
** \param     len  Length in bytes.
** \param     data Pointer to the data buffer.
** \return    BLT_NVM_OKAY if successful, BLT_NVM_NOT_IN_RANGE if the address is
**            not within the supported memory range, or BLT_NVM_ERROR is the write
**            operation failed.
**
****************************************************************************************/
blt_int8u NvmWriteHook(blt_addr addr, blt_int32u len, blt_int8u *data)
{
  return BLT_NVM_NOT_IN_RANGE;
} /*** end of NvmWriteHook ***/


/************************************************************************************//**
** \brief     Callback that gets called at the start of the NVM driver erase 
**            routine. It allows additional memory to be operated on. If the address
**            is not within the range of the additional memory, then
**            BLT_NVM_NOT_IN_RANGE must be returned to indicate that the memory
**            hasn't been erased yet.
** \param     addr Start address.
** \param     len  Length in bytes.
** \return    BLT_NVM_OKAY if successful, BLT_NVM_NOT_IN_RANGE if the address is
**            not within the supported memory range, or BLT_NVM_ERROR is the erase
**            operation failed.
**
****************************************************************************************/
blt_int8u NvmEraseHook(blt_addr addr, blt_int32u len)
{
  return BLT_NVM_NOT_IN_RANGE;
} /*** end of NvmEraseHook ***/


/************************************************************************************//**
** \brief     Callback that gets called at the end of the NVM programming session.
** \return    BLT_TRUE is successful, BLT_FALSE otherwise.
**
****************************************************************************************/
blt_bool NvmDoneHook(void)
{
  return BLT_TRUE;
} /*** end of NvmDoneHook ***/
#endif /* BOOT_NVM_HOOKS_ENABLE > 0 */


#if (BOOT_NVM_CHECKSUM_HOOKS_ENABLE > 0)
/************************************************************************************//**
** \brief     Verifies the checksum, which indicates that a valid user program is
**            present and can be started.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
blt_bool NvmVerifyChecksumHook(void)
{
  return BLT_TRUE;
} /*** end of NvmVerifyChecksum ***/


/************************************************************************************//**
** \brief     Writes a checksum of the user program to non-volatile memory. This is
**            performed once the entire user program has been programmed. Through
**            the checksum, the bootloader can check if a valid user programming is
**            present and can be started.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise. 
**
****************************************************************************************/
blt_bool NvmWriteChecksumHook(void)
{
  return BLT_TRUE;
}
#endif /* BOOT_NVM_CHECKSUM_HOOKS_ENABLE > 0 */


/****************************************************************************************
*   N E T W O R K   I N T E R F A C E   H O O K   F U N C T I O N S
****************************************************************************************/
#if (BOOT_COM_NET_IPADDR_HOOK_ENABLE > 0)
/************************************************************************************//**
** \brief     Callback that gets called when the IP address is about to be configured.
** \param     ipAddrArray 4-byte array where the IP address should be stored.
** \return    none.
**
****************************************************************************************/
void NetIpAddressHook(blt_int8u *ipAddrArray)
{
  /* This hook function allows a dynamic configuration of the IP address. This could for
   * example be used if the bootloader is activated from a running user program and 
   * should have the same IP address as the user program. This IP address could be stored
   * at a fixed location in RAM which can be read here. For now the example implemen-
   * tation simply configures the bootloader's default IP address.
   */
  ipAddrArray[0] = BOOT_COM_NET_IPADDR0;
  ipAddrArray[1] = BOOT_COM_NET_IPADDR1;
  ipAddrArray[2] = BOOT_COM_NET_IPADDR2;
  ipAddrArray[3] = BOOT_COM_NET_IPADDR3;
} /*** end of NetIpAddressHook ***/
#endif /* BOOT_COM_NET_IPADDR_HOOK_ENABLE > 0 */


#if (BOOT_COM_NET_NETMASK_HOOK_ENABLE > 0)
/************************************************************************************//**
** \brief     Callback that gets called when the network mask is about to be configured.
** \param     netMaskArray 4-byte array where the network mask should be stored.
** \return    none.
**
****************************************************************************************/
void NetNetworkMaskHook(blt_int8u *netMaskArray)
{
  /* This hook function allows a dynamic configuration of the network mask. This could 
   * for example be used if the bootloader is activated from a running user program and 
   * should have the same network mask as the user program. This network mask could be 
   * stored at a fixed location in RAM which can be read here. For now the example 
   * implementation simply configures the bootloader's default network mask.
   */
  netMaskArray[0] = BOOT_COM_NET_NETMASK0;
  netMaskArray[1] = BOOT_COM_NET_NETMASK1;
  netMaskArray[2] = BOOT_COM_NET_NETMASK2;
  netMaskArray[3] = BOOT_COM_NET_NETMASK3;
} /*** end of NetNetworkMaskHook ***/
#endif /* BOOT_COM_NET_NETMASK_HOOK_ENABLE > 0 */


#if (BOOT_COM_NET_GATEWAY_HOOK_ENABLE > 0)
/************************************************************************************//**
** \brief     Callback that gets called when the gateway address is about to be 
**            configured.
** \param     gatewayAddrArray 4-byte array where the gateway address should be stored.
** \return    none.
**
****************************************************************************************/
void NetGatewayAddressHook(blt_int8u *gatewayAddrArray)
{
  /* This hook function allows a dynamic configuration of the network mask. This could 
   * for example be used if the bootloader is activated from a running user program and 
   * should have the same network mask as the user program. This network mask could be 
   * stored at a fixed location in RAM which can be read here. For now the example 
   * implementation simply configures the bootloader's default network mask.
   */
  gatewayAddrArray[0] = BOOT_COM_NET_GATEWAY0;
  gatewayAddrArray[1] = BOOT_COM_NET_GATEWAY1;
  gatewayAddrArray[2] = BOOT_COM_NET_GATEWAY2;
  gatewayAddrArray[3] = BOOT_COM_NET_GATEWAY3;
} /*** end of NetGatewayAddressHook ***/
#endif /* BOOT_COM_NET_GATEWAY_HOOK_ENABLE > 0 */


/****************************************************************************************
*   W A T C H D O G   D R I V E R   H O O K   F U N C T I O N S
****************************************************************************************/

#if (BOOT_COP_HOOKS_ENABLE > 0)
/************************************************************************************//**
** \brief     Callback that gets called at the end of the internal COP driver
**            initialization routine. It can be used to configure and enable the
**            watchdog.
** \return    none.
**
****************************************************************************************/
void CopInitHook(void)
{
} /*** end of CopInitHook ***/


/************************************************************************************//**
** \brief     Callback that gets called at the end of the internal COP driver
**            service routine. This gets called upon initialization and during
**            potential long lasting loops and routine. It can be used to service
**            the watchdog to prevent a watchdog reset.
** \return    none.
**
****************************************************************************************/
void CopServiceHook(void)
{
} /*** end of CopServiceHook ***/
#endif /* BOOT_COP_HOOKS_ENABLE > 0 */


/****************************************************************************************
*   F I L E   S Y S T E M   I N T E R F A C E   H O O K   F U N C T I O N S
****************************************************************************************/

